{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        }
    },

    "items": [
        {
            "id": "experience_item_1",
            "place": "@link{places.uxStudio}",
            "period": ["2015/01", "2017/12"],
            "locales": {
                "en": {
                    "title": "UX Designer",
                    "description": "Contributed to designing intuitive and user-friendly web application interfaces, creating engaging and seamless user experiences. Collaborated closely with cross-functional teams and stakeholders to ensure designs aligned with business goals and user needs.",
                    "tags": ["Figma", "Wireframing", "Prototyping", "Responsive Design", "User Research"]
                }
            }
        },

        {
            "id": "experience_item_2",
            "place": "@link{places.adobe}",
            "period": ["2018/01", "2020/08"],
            "locales": {
                "en": {
                    "title": "Senior UI/UX Designer",
                    "description": "Led design projects, conducted comprehensive user research, and utilized data-driven insights to enhance user experiences. Managed design teams, fostering creativity and innovation while implementing design best practices to deliver successful outcomes for various digital products.",
                    "tags": ["Figma", "Adobe XD", "Sketch", "Data-Driven Design"]
                }
            }
        },

        {
            "id": "experience_item_3",
            "place": "@link{places.apple}",
            "period": ["2020/09", "2022/09"],
            "locales": {
                "en": {
                    "title": "Lead UX Designer",
                    "description": "Drove UX initiatives by overseeing a team of designers, crafting design strategies, and spearheading cross-functional collaborations with product managers, engineers, and executives. Focused on creating user-centric designs that aligned with business objectives and resulted in enhanced user satisfaction.",
                    "tags": ["Sketch", "Adobe XD", "InVision", "Design Strategy", "Cross-Functional Collaboration"]
                }
            }
        },

        {
            "id": "experience_item_4",
            "place": "@link{places.coursera}",
            "period": ["2022/10", "now"],
            "locales": {
                "en": {
                    "title": "UX Design Full-Time Professor",
                    "description": "Leveraged my expertise in UX design to educate and inspire students in the art of user-centered design principles. Conducted user studies, analyzed data, and guided students in applying theoretical knowledge to practical projects, empowering the next generation of UX designers.",
                    "tags": ["Adobe XD", "Sketch", "Axure", "Educational Mentorship"]
                }
            }
        }
    ]
}